In [0]:
import numpy as np
import pandas as pd

In [0]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

## Pandas (II) - Ejercicios

+-
Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [0]:
df = pd.DataFrame(data, index = labels)

In [4]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**2.** Return the first 3 rows of the DataFrame `df`.

In [9]:
df[:3] #CUIDADO

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [0]:
df.iloc[0:3]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

In [16]:
df.loc['a':'c']

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**3.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [14]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [18]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**4.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [0]:
df.loc[df.index[[2,3,7]],['animal', 'age']]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

In [0]:
df.loc[['g','h','i'],['animal', 'age']]

  animal  age
g  snake  4.5
h    cat  NaN
i    dog  7.0

**5.** Select only the rows where the number of visits is greater than 3.

In [0]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [0]:
df.loc[df.visits>3]

Empty DataFrame
Columns: [age, animal, priority, visits]
Index: []

**6.** Select the rows where the animal is a cat *and* the age is less than 3.

In [0]:
df[(df["age"]<3)&(df["animal"]=="cat")]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

**7.** Select the rows the age is between 2 and 4 (inclusive).

In [0]:
df.loc[(df.age >=2) & (df.age <=4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

In [0]:
df.loc[df.age.between(2,4,False)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
j  3.0    dog       no       1

**8.** Change the age in row 'f' to 1.5.

In [0]:
df.head(3)

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

In [0]:
df.loc['f','age']=1.5
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**9.** Calculate the sum of all visits (the total number of visits).

In [0]:
sum(df.visits)

19

In [0]:
df.visits.sum()

19

**10.** Append a new row 'k' to `df` with your choice of values for each column.

In [0]:
df.loc['k'] = [6,'cat','no',3]
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1
k  6.0    cat       no       3

In [0]:
df.drop('k')

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [0]:
df.loc['k']= {'age':6, 'animal': 'cat', 'priority': 'no', 'visits': 3}
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1
k  6.0    cat       no       3

In [0]:
# trampa
dictf = {'age':6, 'animal': 'cat', 'priority': 'no', 'visits': 3}
df10 = df.append(dictf,ignore_index = True)
df10

    age animal priority  visits
0   2.5    cat      yes       1
1   3.0    cat      yes       3
2   0.5  snake       no       2
3   NaN    dog      yes       3
4   5.0    dog       no       2
5   1.5    cat       no       3
6   4.5  snake       no       1
7   NaN    cat      yes       1
8   7.0    dog       no       2
9   3.0    dog       no       1
10  6.0    cat       no       3

### 11. Sort df first by the values in "age" in _descending_ order, then by the values in "visits" columns in _ascending_ order.

In [0]:
df.sort_values(["age", "visits"], ascending = [False, True])

   age animal priority  visits
i  7.0    dog       no       2
k  6.0    cat       no       3
e  5.0    dog       no       2
g  4.5  snake       no       1
j  3.0    dog       no       1
b  3.0    cat      yes       3
a  2.5    cat      yes       1
f  1.5    cat       no       3
c  0.5  snake       no       2
h  NaN    cat      yes       1
d  NaN    dog      yes       3

### 12. For each animal type and each number of visits, find the mean age.

In [0]:
pd.pivot_table(df, values= 'age', index=['animal'], columns=['visits'], aggfunc=np.mean)

visits    1    2    3
animal
cat     2.5  NaN  3.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN